Tekla Open API Reference for Tekla Structures 2025
WeldAttributes Properties
The Weld.WeldAttributes type exposes the following members.
Properties
Name | Description
CustomPresentation
 Custom presentation GUID to be applied to the weld
DrawHiddenLines
 True if hidden lines are drawn.
DrawOwnHiddenLines
 True if own hidden lines are drawn.
HiddenLines
 The line type of hidden lines.
Representation
 The representation of the weld.
VisibleLines
 The line type of visible lines.
Top
See Also
Reference
Weld.WeldAttributes Class
Tekla.Structures.Drawing Namespace